//ИИ ПОМОГ С ОПТИМИЗАЦИЕЙ SEO, ПРОИЗВОДИТЕЛЬНОСТИ И ДОСТУПНОСТИ

export default function Price() {
    return (
        <div id='price' className='px-4 xl:px-10 pt-16 xl:pt-30'>
            <div className='flex flex-col gap-5 xl:hidden'>
                <h2 className='font-medium text-3xl/9 text-black'>Сравнение с другими продуктами</h2>
                <div className='flex flex-col gap-1 text-[#808080] text-base/5'>
                    <p>«Complex SW СУСТАВЫ» — это комплексная добавка, сочетающая высокие дозировки глюкозамина и хондроитина с противовоспалительной босвеллией и полным набором витаминов для защиты соединительной ткани.</p>
                    <p>В отличие от многих стандартных средств на рынке, он предлагает законченную систему «все в одной порции».</p>
                    <p>Ключевым преимуществом является наличие клинически значимых дозировок (например, 1250 мг глюкозамина), тогда как многие на рынке используют уменьшенные дозировки ради экономии.</p>
                </div>
            </div>

            {/* ТУТ ИИ ПОМОГ ГРАМОТНО РАССТАВИТЬ ТЕКСТ И БАНКУ, ЧТОБЫ ОНА НЕ РАЗЪЕЗЖАЛАСЬ НА ВСЕХ ЭКРАНАХ */}
            <div className='pt-11 flex xl:hidden items-start'>
                <div className='flex-1 flex flex-col'>
                    <div className='flex flex-col gap-8 pt-4'>
                        <div className=''>
                            <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M27.9056 4.0932C26.2122 2.39987 23.3456 2.19987 19.8256 3.55987C18.5722 4.03987 17.2922 4.70654 15.9989 5.50654C14.7056 4.6932 13.4122 4.03987 12.1722 3.55987C8.66556 2.2132 5.78556 2.39987 4.09223 4.0932C2.39889 5.78654 2.19889 8.6532 3.55889 12.1732C4.03889 13.4265 4.70556 14.7065 5.50556 15.9999C4.69223 17.2932 4.03889 18.5865 3.55889 19.8265C2.21223 23.3332 2.39889 26.2132 4.09223 27.9065C5.03889 28.8532 6.35889 29.3332 7.94556 29.3332C9.19889 29.3332 10.6256 29.0399 12.1722 28.4399C13.4256 27.9599 14.7056 27.2932 15.9989 26.4932C17.2922 27.3065 18.5856 27.9599 19.8256 28.4399C21.3722 29.0399 22.7989 29.3332 24.0522 29.3332C25.6389 29.3332 26.9589 28.8532 27.9056 27.9065C29.5989 26.2132 29.7989 23.3465 28.4389 19.8265C27.9589 18.5732 27.2922 17.2932 26.4922 15.9999C27.3056 14.7065 27.9589 13.4132 28.4389 12.1732C29.7856 8.66654 29.5989 5.78654 27.9056 4.0932ZM6.05223 11.2132C5.13223 8.8132 5.10556 6.8532 5.98556 5.9732C6.41223 5.54654 7.09223 5.3332 7.95889 5.3332C8.86556 5.3332 9.98556 5.5732 11.2122 6.03987C11.9856 6.3332 12.7856 6.71987 13.5989 7.1732C11.1955 9.0277 9.04006 11.1831 7.18556 13.5865C6.73223 12.7732 6.34556 11.9865 6.05223 11.1999V11.2132ZM15.9989 8.71987C18.8011 10.7395 21.2593 13.1977 23.2789 15.9999C21.2593 18.802 18.8011 21.2603 15.9989 23.2799C13.1967 21.2603 10.7385 18.802 8.71889 15.9999C10.7385 13.1977 13.1967 10.7395 15.9989 8.71987ZM11.2122 25.9465C8.81223 26.8665 6.85223 26.8932 5.97223 26.0132C5.09223 25.1332 5.11889 23.1732 6.03889 20.7732C6.33223 19.9999 6.71889 19.1999 7.17223 18.3865C9.02672 20.79 11.1821 22.9454 13.5856 24.7999C12.7722 25.2532 11.9856 25.6399 11.1989 25.9332L11.2122 25.9465ZM25.9456 20.7732C26.8656 23.1732 26.8922 25.1332 26.0122 26.0132C25.1322 26.8932 23.1722 26.8665 20.7722 25.9465C19.9989 25.6532 19.1989 25.2665 18.3856 24.8132C20.789 22.9587 22.9444 20.8033 24.7989 18.3999C25.2522 19.2132 25.6389 19.9999 25.9322 20.7865L25.9456 20.7732ZM25.9456 11.1999C25.6522 11.9732 25.2656 12.7732 24.8122 13.5865C22.9577 11.1831 20.8023 9.0277 18.3989 7.1732C19.2122 6.71987 19.9989 6.3332 20.7856 6.03987C22.0122 5.5732 23.1322 5.3332 24.0389 5.3332C24.9456 5.3332 25.5856 5.54654 26.0256 5.9732C26.9056 6.8532 26.8789 8.8132 25.9589 11.2132L25.9456 11.1999Z" fill="#3193CC" />
                                <path d="M18.3563 18.3602C19.6629 17.0535 19.6629 14.9468 18.3563 13.6402C17.0496 12.3335 14.9429 12.3335 13.6363 13.6402C12.3296 14.9468 12.3296 17.0535 13.6363 18.3602C14.9429 19.6668 17.0496 19.6668 18.3563 18.3602Z" fill="#3193CC" />
                            </svg>
                            <div className='flex flex-col gap-2'>
                                <h2 className='pt-3 text-black text-xl/6 font-medium'>1 порция = 17 обычных капсул</h2>
                                <p className='text-[#808080] text-base/5'>Доза в 3 раза выше конкурентов. Достаточно одной порции в день</p>
                            </div>
                        </div>

                        <div className=''>
                            <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M27.9056 4.0932C26.2122 2.39987 23.3456 2.19987 19.8256 3.55987C18.5722 4.03987 17.2922 4.70654 15.9989 5.50654C14.7056 4.6932 13.4122 4.03987 12.1722 3.55987C8.66556 2.2132 5.78556 2.39987 4.09223 4.0932C2.39889 5.78654 2.19889 8.6532 3.55889 12.1732C4.03889 13.4265 4.70556 14.7065 5.50556 15.9999C4.69223 17.2932 4.03889 18.5865 3.55889 19.8265C2.21223 23.3332 2.39889 26.2132 4.09223 27.9065C5.03889 28.8532 6.35889 29.3332 7.94556 29.3332C9.19889 29.3332 10.6256 29.0399 12.1722 28.4399C13.4256 27.9599 14.7056 27.2932 15.9989 26.4932C17.2922 27.3065 18.5856 27.9599 19.8256 28.4399C21.3722 29.0399 22.7989 29.3332 24.0522 29.3332C25.6389 29.3332 26.9589 28.8532 27.9056 27.9065C29.5989 26.2132 29.7989 23.3465 28.4389 19.8265C27.9589 18.5732 27.2922 17.2932 26.4922 15.9999C27.3056 14.7065 27.9589 13.4132 28.4389 12.1732C29.7856 8.66654 29.5989 5.78654 27.9056 4.0932ZM6.05223 11.2132C5.13223 8.8132 5.10556 6.8532 5.98556 5.9732C6.41223 5.54654 7.09223 5.3332 7.95889 5.3332C8.86556 5.3332 9.98556 5.5732 11.2122 6.03987C11.9856 6.3332 12.7856 6.71987 13.5989 7.1732C11.1955 9.0277 9.04006 11.1831 7.18556 13.5865C6.73223 12.7732 6.34556 11.9865 6.05223 11.1999V11.2132ZM15.9989 8.71987C18.8011 10.7395 21.2593 13.1977 23.2789 15.9999C21.2593 18.802 18.8011 21.2603 15.9989 23.2799C13.1967 21.2603 10.7385 18.802 8.71889 15.9999C10.7385 13.1977 13.1967 10.7395 15.9989 8.71987ZM11.2122 25.9465C8.81223 26.8665 6.85223 26.8932 5.97223 26.0132C5.09223 25.1332 5.11889 23.1732 6.03889 20.7732C6.33223 19.9999 6.71889 19.1999 7.17223 18.3865C9.02672 20.79 11.1821 22.9454 13.5856 24.7999C12.7722 25.2532 11.9856 25.6399 11.1989 25.9332L11.2122 25.9465ZM25.9456 20.7732C26.8656 23.1732 26.8922 25.1332 26.0122 26.0132C25.1322 26.8932 23.1722 26.8665 20.7722 25.9465C19.9989 25.6532 19.1989 25.2665 18.3856 24.8132C20.789 22.9587 22.9444 20.8033 24.7989 18.3999C25.2522 19.2132 25.6389 19.9999 25.9322 20.7865L25.9456 20.7732ZM25.9456 11.1999C25.6522 11.9732 25.2656 12.7732 24.8122 13.5865C22.9577 11.1831 20.8023 9.0277 18.3989 7.1732C19.2122 6.71987 19.9989 6.3332 20.7856 6.03987C22.0122 5.5732 23.1322 5.3332 24.0389 5.3332C24.9456 5.3332 25.5856 5.54654 26.0256 5.9732C26.9056 6.8532 26.8789 8.8132 25.9589 11.2132L25.9456 11.1999Z" fill="#3193CC" />
                                <path d="M18.3563 18.3602C19.6629 17.0535 19.6629 14.9468 18.3563 13.6402C17.0496 12.3335 14.9429 12.3335 13.6363 13.6402C12.3296 14.9468 12.3296 17.0535 13.6363 18.3602C14.9429 19.6668 17.0496 19.6668 18.3563 18.3602Z" fill="#3193CC" />
                            </svg>
                            <div className='flex flex-col gap-2 pt-3'>
                                <h2 className='text-black text-xl font-medium'>Курс на 1 месяц</h2>
                                <p className='text-[#808080] text-base/5'>30 порций = 130₽ в день</p>
                            </div>
                        </div>
                    </div>

                    <div className='flex pt-3'>
                        <a aria-label='Купить в 1 клик' href='#price-card' className='bg-[#3193CC] rounded-4xl px-4 py-1.5 text-white text-base font-medium'>
                            Купить в 1 клик
                        </a>
                        <a aria-label='Купить в 1 клик' href='#price-card' className='bg-[#3193CC] rounded-full w-10 h-10 flex items-center justify-center'>
                            <svg
                                className='w-6 h-6 text-white transform -rotate-45 ml-1 mb-1'
                                fill='none'
                                stroke='currentColor'
                                viewBox='0 0 24 24'>
                                <path strokeLinecap='round' strokeLinejoin='round' strokeWidth={2} d='M9 5l7 7-7 7 M16 12l-12 0' />
                            </svg>
                        </a>
                    </div>
                </div>

                <div className='shrink-0 -mr-13'>
                    <img loading='lazy' className='w-50 h-100' src='jar-price.webp' alt='Суставы БАД COMPLEX SW Оптисалт' />
                </div>
            </div>

            <div className='hidden xl:flex flex-col gap-8'>
                <h2 className='font-medium text-5xl text-black'>Сравнение с другими продуктами</h2>

                <div className='grid grid-cols-[1fr_auto_1fr] gap-x-23 [--mid-col:400px] [--grid-gap:92px]'>
                    <div className='flex flex-col justify-between'>
                        <div className='flex flex-col gap-1'>
                            <p>«Complex SW СУСТАВЫ» — это комплексная добавка, сочетающая высокие дозировки глюкозамина и хондроитина с противовоспалительной босвеллией и полным набором витаминов для защиты соединительной ткани. </p>
                            <p>В отличие от многих стандартных средств на рынке, он предлагает законченную систему «все в одной порции».</p>
                            <p>Ключевым преимуществом является наличие клинически значимых дозировок (например, 1250 мг глюкозамина), тогда как многие на рынке используют уменьшенные дозировки ради экономии.</p>
                        </div>
                        <div className='flex flex-col gap-6'>
                            <svg width="40" height="40" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M27.9056 4.0932C26.2122 2.39987 23.3456 2.19987 19.8256 3.55987C18.5722 4.03987 17.2922 4.70654 15.9989 5.50654C14.7056 4.6932 13.4122 4.03987 12.1722 3.55987C8.66556 2.2132 5.78556 2.39987 4.09223 4.0932C2.39889 5.78654 2.19889 8.6532 3.55889 12.1732C4.03889 13.4265 4.70556 14.7065 5.50556 15.9999C4.69223 17.2932 4.03889 18.5865 3.55889 19.8265C2.21223 23.3332 2.39889 26.2132 4.09223 27.9065C5.03889 28.8532 6.35889 29.3332 7.94556 29.3332C9.19889 29.3332 10.6256 29.0399 12.1722 28.4399C13.4256 27.9599 14.7056 27.2932 15.9989 26.4932C17.2922 27.3065 18.5856 27.9599 19.8256 28.4399C21.3722 29.0399 22.7989 29.3332 24.0522 29.3332C25.6389 29.3332 26.9589 28.8532 27.9056 27.9065C29.5989 26.2132 29.7989 23.3465 28.4389 19.8265C27.9589 18.5732 27.2922 17.2932 26.4922 15.9999C27.3056 14.7065 27.9589 13.4132 28.4389 12.1732C29.7856 8.66654 29.5989 5.78654 27.9056 4.0932ZM6.05223 11.2132C5.13223 8.8132 5.10556 6.8532 5.98556 5.9732C6.41223 5.54654 7.09223 5.3332 7.95889 5.3332C8.86556 5.3332 9.98556 5.5732 11.2122 6.03987C11.9856 6.3332 12.7856 6.71987 13.5989 7.1732C11.1955 9.0277 9.04006 11.1831 7.18556 13.5865C6.73223 12.7732 6.34556 11.9865 6.05223 11.1999V11.2132ZM15.9989 8.71987C18.8011 10.7395 21.2593 13.1977 23.2789 15.9999C21.2593 18.802 18.8011 21.2603 15.9989 23.2799C13.1967 21.2603 10.7385 18.802 8.71889 15.9999C10.7385 13.1977 13.1967 10.7395 15.9989 8.71987ZM11.2122 25.9465C8.81223 26.8665 6.85223 26.8932 5.97223 26.0132C5.09223 25.1332 5.11889 23.1732 6.03889 20.7732C6.33223 19.9999 6.71889 19.1999 7.17223 18.3865C9.02672 20.79 11.1821 22.9454 13.5856 24.7999C12.7722 25.2532 11.9856 25.6399 11.1989 25.9332L11.2122 25.9465ZM25.9456 20.7732C26.8656 23.1732 26.8922 25.1332 26.0122 26.0132C25.1322 26.8932 23.1722 26.8665 20.7722 25.9465C19.9989 25.6532 19.1989 25.2665 18.3856 24.8132C20.789 22.9587 22.9444 20.8033 24.7989 18.3999C25.2522 19.2132 25.6389 19.9999 25.9322 20.7865L25.9456 20.7732ZM25.9456 11.1999C25.6522 11.9732 25.2656 12.7732 24.8122 13.5865C22.9577 11.1831 20.8023 9.0277 18.3989 7.1732C19.2122 6.71987 19.9989 6.3332 20.7856 6.03987C22.0122 5.5732 23.1322 5.3332 24.0389 5.3332C24.9456 5.3332 25.5856 5.54654 26.0256 5.9732C26.9056 6.8532 26.8789 8.8132 25.9589 11.2132L25.9456 11.1999Z" fill="#3193CC" />
                                <path d="M18.3563 18.3602C19.6629 17.0535 19.6629 14.9468 18.3563 13.6402C17.0496 12.3335 14.9429 12.3335 13.6363 13.6402C12.3296 14.9468 12.3296 17.0535 13.6363 18.3602C14.9429 19.6668 17.0496 19.6668 18.3563 18.3602Z" fill="#3193CC" />
                            </svg>
                            <div className='relative flex flex-col gap-4
      before:absolute before:left-0 before:top-0 before:h-0
      before:border-t-2 before:border-[#DAE2EA]
      before:w-[calc(100%+var(--grid-gap)+var(--mid-col))]' />
      {/* ЛИНИЯ РАЗДЕЛЕНИЯ, КОТОРАЯ ВИЗУАЛЬНО ВХОДИТ В БАНКУ С ПОМОЩЬЮ CODEX */}

                            <div className='flex flex-col gap-4'>
                                <h2 className='text-black text-3xl font-medium'>1 порция = 17 обычных капсул</h2>
                                <p className='text-[#808080] text-xl'>Доза в 3 раза выше конкурентов. Достаточно одной порции в день</p>
                            </div>
                        </div>
                    </div>
                    <div className='flex items-center justify-center'>
                        <img loading='lazy' className='w-150 h-200 z-2' src='/jar.webp' alt='Суставы БАД COMPLEX SW Оптисалт' />
                    </div>
                    <div className='flex flex-col'>
                        <div className='flex flex-col gap-6'>
                            <svg width="40" height="40" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M27.9056 4.0932C26.2122 2.39987 23.3456 2.19987 19.8256 3.55987C18.5722 4.03987 17.2922 4.70654 15.9989 5.50654C14.7056 4.6932 13.4122 4.03987 12.1722 3.55987C8.66556 2.2132 5.78556 2.39987 4.09223 4.0932C2.39889 5.78654 2.19889 8.6532 3.55889 12.1732C4.03889 13.4265 4.70556 14.7065 5.50556 15.9999C4.69223 17.2932 4.03889 18.5865 3.55889 19.8265C2.21223 23.3332 2.39889 26.2132 4.09223 27.9065C5.03889 28.8532 6.35889 29.3332 7.94556 29.3332C9.19889 29.3332 10.6256 29.0399 12.1722 28.4399C13.4256 27.9599 14.7056 27.2932 15.9989 26.4932C17.2922 27.3065 18.5856 27.9599 19.8256 28.4399C21.3722 29.0399 22.7989 29.3332 24.0522 29.3332C25.6389 29.3332 26.9589 28.8532 27.9056 27.9065C29.5989 26.2132 29.7989 23.3465 28.4389 19.8265C27.9589 18.5732 27.2922 17.2932 26.4922 15.9999C27.3056 14.7065 27.9589 13.4132 28.4389 12.1732C29.7856 8.66654 29.5989 5.78654 27.9056 4.0932ZM6.05223 11.2132C5.13223 8.8132 5.10556 6.8532 5.98556 5.9732C6.41223 5.54654 7.09223 5.3332 7.95889 5.3332C8.86556 5.3332 9.98556 5.5732 11.2122 6.03987C11.9856 6.3332 12.7856 6.71987 13.5989 7.1732C11.1955 9.0277 9.04006 11.1831 7.18556 13.5865C6.73223 12.7732 6.34556 11.9865 6.05223 11.1999V11.2132ZM15.9989 8.71987C18.8011 10.7395 21.2593 13.1977 23.2789 15.9999C21.2593 18.802 18.8011 21.2603 15.9989 23.2799C13.1967 21.2603 10.7385 18.802 8.71889 15.9999C10.7385 13.1977 13.1967 10.7395 15.9989 8.71987ZM11.2122 25.9465C8.81223 26.8665 6.85223 26.8932 5.97223 26.0132C5.09223 25.1332 5.11889 23.1732 6.03889 20.7732C6.33223 19.9999 6.71889 19.1999 7.17223 18.3865C9.02672 20.79 11.1821 22.9454 13.5856 24.7999C12.7722 25.2532 11.9856 25.6399 11.1989 25.9332L11.2122 25.9465ZM25.9456 20.7732C26.8656 23.1732 26.8922 25.1332 26.0122 26.0132C25.1322 26.8932 23.1722 26.8665 20.7722 25.9465C19.9989 25.6532 19.1989 25.2665 18.3856 24.8132C20.789 22.9587 22.9444 20.8033 24.7989 18.3999C25.2522 19.2132 25.6389 19.9999 25.9322 20.7865L25.9456 20.7732ZM25.9456 11.1999C25.6522 11.9732 25.2656 12.7732 24.8122 13.5865C22.9577 11.1831 20.8023 9.0277 18.3989 7.1732C19.2122 6.71987 19.9989 6.3332 20.7856 6.03987C22.0122 5.5732 23.1322 5.3332 24.0389 5.3332C24.9456 5.3332 25.5856 5.54654 26.0256 5.9732C26.9056 6.8532 26.8789 8.8132 25.9589 11.2132L25.9456 11.1999Z" fill="#3193CC" />
                                <path d="M18.3563 18.3602C19.6629 17.0535 19.6629 14.9468 18.3563 13.6402C17.0496 12.3335 14.9429 12.3335 13.6363 13.6402C12.3296 14.9468 12.3296 17.0535 13.6363 18.3602C14.9429 19.6668 17.0496 19.6668 18.3563 18.3602Z" fill="#3193CC" />
                            </svg>
                            <div className='relative flex flex-col gap-4
      before:absolute before:right-0 before:top-0 before:h-0
      before:border-t-2 before:border-[#DAE2EA]
      before:w-[calc(100%+var(--grid-gap)+var(--mid-col))]' />
      {/* ЛИНИЯ РАЗДЕЛЕНИЯ, КОТОРАЯ ВИЗУАЛЬНО ВХОДИТ В БАНКУ С ПОМОЩЬЮ CODEX */}

                            <div className='flex flex-col gap-6'>
                                <div className='flex flex-col gap-4'>
                                    <h2 className='text-black font-medium text-3xl'>Курс на 1 месяц</h2>
                                    <p className='text-[#808080] text-xl'>30 порций = 130₽ в день</p>
                                </div>
                                <div className='flex'>
                                    <a aria-label='Купить в 1 клик' href='https://example.com' className='bg-[#3193CC] rounded-4xl px-6 py-2 text-white text-2xl font-medium'>
                                        Купить в 1 клик
                                    </a>
                                    <a href='https://example.com' aria-label='Купить в 1 клик' className='bg-[#3193CC] rounded-full w-14 h-14 flex items-center justify-center'>
                                        <svg
                                            className='w-8 h-8 text-white transform -rotate-45 ml-1 mb-1'
                                            fill='none'
                                            stroke='currentColor'
                                            viewBox='0 0 24 24'>
                                            <path strokeLinecap='round' strokeLinejoin='round' strokeWidth={2} d='M9 5l7 7-7 7 M16 12l-12 0' />
                                        </svg>
                                    </a>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </div>

            <div className='flex flex-col pt-16 gap-2 xl:gap-6 xl:flex-row xl:pt-30'>
                <div id='price-card' className='price-card-bg flex-1 flex flex-col gap-4 py-10 px-7 xl:py-20 xl:px-40 xl:gap-8 xl:bg-size-90% items-center justify-between text-center rounded-4xl'>
                    <h2 className='text-xl/6 xl:text-3xl font-medium text-white'>«Complex SW СУСТАВЫ» для опорно-двигательного аппарата</h2>
                    <img loading='lazy' className='w-50 h-70 xl:w-115 xl:h-145 shrink-0' src='jar-price-card.webp' alt='Суставы БАД COMPLEX SW Оптисалт' />
                    <div className='text-white flex flex-col gap-2'>
                        <h2 className='font-medium text-xl xl:text-3xl'>3 900 ₽</h2>
                        <p className='text-base'>420г. / 30 порций</p>
                    </div>

                    <div className='flex'>
                        <a aria-label='Купить в 1 клик' href='https://example.com' className='bg-white rounded-4xl px-4 py-1.5 xl:px-6 xl:py-2 text-[#3193CC] text-base xl:text-2xl font-medium'>
                            Купить в 1 клик
                        </a>
                        <a aria-label='Купить в 1 клик' href='https://example.com' className='bg-white rounded-full w-10 h-10 xl:w-14 xl:h-14 flex items-center justify-center'>
                            <svg
                                className='w-6 h-6 xl:w-8 xl:h-8 text-[#3193CC] transform -rotate-45 ml-1 mb-1'
                                fill='none'
                                stroke='currentColor'
                                viewBox='0 0 24 24'>
                                <path strokeLinecap='round' strokeLinejoin='round' strokeWidth={2} d='M9 5l7 7-7 7 M16 12l-12 0' />
                            </svg>
                        </a>
                    </div>
                </div>

                <div className='flex-1 flex flex-col bg-white py-10 px-7 xl:py-20 xl:gap-8 xl:px-40 justify-between items-center text-center rounded-4xl'>
                    <h2 className='text-xl/6 xl:text-3xl font-medium text-black'>Инструкция и рекомендации по применению</h2>
                    <img loading='lazy' className='shrink-0 xl:w-170 xl:h-115' src='/instruction-xl.webp' alt='Иструкция по употреблению Суставы БАД COMPLEX SW Оптисалт'/>
                    <div className='flex flex-col gap-1 text-[#1C1C1C] text-xl xl:text-2xl'>
                        <p>1 ложка в день </p>
                        <p>Растворить в 200 мл воды </p>
                        <p>Принимать утром</p>
                    </div>
                </div>
            </div>
        </div>
    );
}